// 2
// Требуется посчитать сумму целых чисел, расположенных между числами 1 и N включительно.
// Входные данные
// В единственной строке входного файла INPUT.TXT записано единственное целое число N, не превышающее по абсолютной величине 104.
// Выходные данные
// В единственную строку выходного файла OUTPUT.TXT нужно вывести одно целое число — сумму чисел, расположенных между 1 и N включительно.

#include <iostream>
#include <fstream>

using namespace std;

int main()
{
    // Открываем файлы для чтения и записи
    ifstream fin("INPUT.TXT");
    ofstream fout("OUTPUT.TXT");

    int N;
    int sum = 0;

    // Считываем два числа из входного файла
    fin >> N;

    // Вычисляем сумму и записываем в выходной файл
    if (N > 0)
    {
        for (int i{1}; i < N + 1; i++)
        {
            sum += i;
        }
    }
    else if (N == 0)
        sum = 1;
    else
    {
        for (int i{N}; i < 2; i++)
        {
            sum += i;
        }
    }

    fout << sum;

    // Закрываем файлы
    fin.close();
    fout.close();

    return 0;
}