# 7
# Главный вождь племени Абба не умеет считать. В обмен на одну из его земель вождь другого племени предложил ему выбрать одну из трех куч с золотыми монетами. 
# Но вождю племени Абба хочется получить наибольшее количество золотых монет. Помогите вождю сделать правильный выбор!
# Входные данные
# В первой строке входного файла INPUT.TXT записаны три натуральных числа через пробел. Каждое из чисел не превышает 10100. Числа записаны без ведущих нулей.
# Выходные данные
# В выходной файл OUTPUT.TXT нужно вывести одно целое число — максимальное количество монет, которые может взять вождь. 

def main():
    with open('INPUT.TXT') as input:
        A = input.readline().strip().split()
        B = []
        
        with open('OUTPUT.TXT', 'w') as output:
            for i in range (0, len(A)):
                B.append(int(A[i]) )
                
            result = max(B)      
            output.write(str(result))


if __name__ == '__main__':
    main() 