# 5
# Вася не любит английский язык, но каждый раз старается получить хотя бы четверку за четверть, чтобы оставаться ударником. 
# В текущей четверти Вася заметил следующую закономерность: по нечетным дням месяца он получал тройки, а по четным – четверки. 
# Так же он помнит, в какие дни он получал эти оценки. Поэтому он выписал на бумажке все эти дни для того, чтобы оценить, сколько у него троек и сколько четверок. 
# Помогите Васе это сделать, расположив четные и нечетные числа в разных строчках. Вася может рассчитывать на оценку 4, если четверок не меньше, чем троек.
# Входные данные
# В первой строке входного файла INPUT.TXT записано единственное число N – количество элементов целочисленного массива (1 ≤ N ≤ 100). 
# Вторая строка содержит N чисел, представляющих заданный массив. Каждый элемент массива – натуральное число от 1 до 31. Все элементы массива разделены пробелом.
# Выходные данные
# В первую строку выходного файла OUTPUT.TXT нужно вывести числа, которые соответствуют дням месяцев, в которые Вася получил тройки, 
# а во второй строке соответственно расположить числа месяца, в которые Вася получил четверки. В третьей строке нужно вывести «YES», 
# если Вася может рассчитывать на четверку и «NO» в противном случае. В каждой строчке числа следует выводить в том же порядке, в котором они идут во входных данных. 
# При выводе числа отделяются пробелом. 

def main():
    with open('python/INPUT.TXT') as input:
        N = input.readline()
        N_list = input.readline()
        even_list = []
        not_even_list = []
        N_list = N_list.split()
        for item in N_list:
            if int(item) % 2 == 0:
                even_list.append(item)
            else:
                not_even_list.append(item)
        not_even_str = ''
        even_str = ''
        for item in not_even_list:
            not_even_str += ' '
            not_even_str += item
        for item in even_list:
                    even_str += ' '
                    even_str += item
        with open('python/OUTPUT.TXT', 'w') as output:
            output.write(not_even_str[1:])
            output.write('\n') 
            output.write(even_str[1:])
            output.write('\n')
            if len(even_list) >= len(not_even_list):
                output.write('YES')
            else:
                output.write('NO')


if __name__ == '__main__':
    main() 